# В этом ката мы хотим преобразовать строку в целое число. Строки
# представляют числа словами.
#
# Примеры:
# "один" => 1
# "двадцать" => 20
# "двести сорок шесть" => 246
# "семьсот восемьдесят три тысячи девятьсот девятнадцать" => 783919
#
# Дополнительные примечания:
# Минимальное количество "ноль" (включительно).
# Максимальное количество, которое должно поддерживаться, составляет 1 миллион
# (включительно) "И" в т.ч. "сто двадцать четыре" не обязательно, в одних
# случаях присутствует, а в других нет.
# Все проверенные номера действительны, вам не нужно их проверять