# https://www.codewars.com/kata/51ba717bb08c1cd60f00002f/python
# Формат для выражения упорядоченного списка целых чисел заключается в
# использовании списка, разделенного запятыми, либо отдельные целые числа
# или диапазон целых чисел, обозначенный начальным целым числом, отделенным
# от конечного целого числа в диапазоне дефисом «-».
# Диапазон включает все целые числа в интервале, включая обе конечные точки.
# Он не считается диапазоном, если он не охватывает как минимум 3 числа.
# Например "12,13,15-17"