# https://www.codewars.com/kata/51ba717bb08c1cd60f00002f/python
# Range Extraction
# Формат записи упорядоченного списка целых чисел заключается в
# использовании чисел, разделенных запятыми, либо отдельных целые числа
# или диапазонов целых чисел, обозначенных начальным целым числом,
# отделенным от конечного целого числа в диапазоне дефисом «-».
# Диапазон включает все целые числа в интервале, включая обе конечные точки.
# Он не считается диапазоном, если он не охватывает как минимум 3 числа.
# Например: "12,13,15-17"